; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared0 - mode
	thermograph1 - mode
	GroundStation0 - direction
	Star9 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Star6 - direction
	Star3 - direction
	Star1 - direction
	Star4 - direction
	GroundStation10 - direction
	GroundStation8 - direction
	GroundStation7 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation8)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star3)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation10)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(have_image Planet11 thermograph1)
	(have_image Star12 thermograph1)
	(have_image Planet13 infrared0)
	(have_image Star14 infrared0)
	(have_image Planet15 thermograph1)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 5
2. (calibrate satellite1 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 0 of 5
3. (turn_to satellite1 planet13 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet13)
   goals met: 0 of 5
4. (take_image satellite1 planet13 instrument4 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 1 of 5
5. (turn_to satellite1 planet11 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet11)
   goals met: 1 of 5
6. (take_image satellite1 planet11 instrument4 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 2 of 5
7. (turn_to satellite1 planet15 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet15)
   goals met: 2 of 5
8. (take_image satellite1 planet15 instrument4 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 3 of 5
9. (turn_to satellite1 star12 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star12)
   goals met: 3 of 5
10. (take_image satellite1 star12 instrument4 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 4 of 5
11. (turn_to satellite1 star14 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star14)
   goals met: 4 of 5
12. (take_image satellite1 star14 instrument4 infrared0)
   added: (have_image star14 infrared0)
   goals met: 5 of 5
